Localhost_hw21/results/html_1000/statistics.json
{
  "DELETE /character/1" : {
    "transaction" : "DELETE /character/1",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.251000000000002,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 17.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 6.949999999999932,
    "pct3ResTime" : 12.0,
    "throughput" : 10.146721594252895,
    "receivedKBytesPerSec" : 2.9033099874180652,
    "sentKBytesPerSec" : 2.0611519129106886
  },
  "GET_characters" : {
    "transaction" : "GET_characters",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6.072000000000007,
    "medianResTime" : 4.0,
    "minResTime" : 2.0,
    "maxResTime" : 61.0,
    "pct1ResTime" : 13.0,
    "pct2ResTime" : 16.0,
    "pct3ResTime" : 59.0,
    "throughput" : 10.12996748280438,
    "receivedKBytesPerSec" : 4.288844230856894,
    "sentKBytesPerSec" : 1.8301210784363382
  },
  "PUT_character_by_id" : {
    "transaction" : "PUT_character_by_id",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.3139999999999996,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 26.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 7.0,
    "pct3ResTime" : 10.0,
    "throughput" : 10.146206840572653,
    "receivedKBytesPerSec" : 2.7249104914315283,
    "sentKBytesPerSec" : 2.487108768605607
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.0469999999999957,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 61.0,
    "pct1ResTime" : 6.0,
    "pct2ResTime" : 9.0,
    "pct3ResTime" : 16.98999999999978,
    "throughput" : 50.647272137922656,
    "receivedKBytesPerSec" : 15.397690690145055,
    "sentKBytesPerSec" : 10.683705727953242
  },
  "POST_character" : {
    "transaction" : "POST_character",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.408000000000001,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 21.0,
    "pct1ResTime" : 5.899999999999977,
    "pct2ResTime" : 7.0,
    "pct3ResTime" : 11.0,
    "throughput" : 10.137155716848966,
    "receivedKBytesPerSec" : 2.7719775119871866,
    "sentKBytesPerSec" : 2.4748915324338294
  },
  "GET_character_by_id" : {
    "transaction" : "GET_character_by_id",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.190000000000001,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 20.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 10.0,
    "throughput" : 10.14579507523107,
    "receivedKBytesPerSec" : 2.7247999058977506,
    "sentKBytesPerSec" : 1.8429876386169253
  }
}