Localhost_hw21/results/html_1000_30sec/statistics.json
{
  "DELETE /character/1" : {
    "transaction" : "DELETE /character/1",
    "sampleCount" : 19763,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 109.06193391691485,
    "medianResTime" : 107.0,
    "minResTime" : 21.0,
    "maxResTime" : 476.0,
    "pct1ResTime" : 140.0,
    "pct2ResTime" : 161.0,
    "pct3ResTime" : 251.36000000000058,
    "throughput" : 719.5441636932935,
    "receivedKBytesPerSec" : 205.88519527552245,
    "sentKBytesPerSec" : 147.48899064980338
  },
  "GET_characters" : {
    "transaction" : "GET_characters",
    "sampleCount" : 20687,
    "errorCount" : 798,
    "errorPct" : 3.857495,
    "meanResTime" : 910.667665683762,
    "medianResTime" : 105.0,
    "minResTime" : 20.0,
    "maxResTime" : 28638.0,
    "pct1ResTime" : 149.0,
    "pct2ResTime" : 171.0,
    "pct3ResTime" : 28383.0,
    "throughput" : 722.1601619772395,
    "receivedKBytesPerSec" : 6570.557441756702,
    "sentKBytesPerSec" : 129.46561038190322
  },
  "PUT_character_by_id" : {
    "transaction" : "PUT_character_by_id",
    "sampleCount" : 19906,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 106.50587762483667,
    "medianResTime" : 102.0,
    "minResTime" : 17.0,
    "maxResTime" : 400.0,
    "pct1ResTime" : 139.0,
    "pct2ResTime" : 172.0,
    "pct3ResTime" : 204.0,
    "throughput" : 723.144548988266,
    "receivedKBytesPerSec" : 195.54263626394086,
    "sentKBytesPerSec" : 178.59393589702836
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 100574,
    "errorCount" : 882,
    "errorPct" : 0.87696624,
    "meanResTime" : 278.5465030723655,
    "medianResTime" : 120.0,
    "minResTime" : 1.0,
    "maxResTime" : 28638.0,
    "pct1ResTime" : 165.0,
    "pct2ResTime" : 222.0,
    "pct3ResTime" : 28383.0,
    "throughput" : 3510.9264818822876,
    "receivedKBytesPerSec" : 7338.945084774052,
    "sentKBytesPerSec" : 742.80437141093
  },
  "POST_character" : {
    "transaction" : "POST_character",
    "sampleCount" : 20164,
    "errorCount" : 84,
    "errorPct" : 0.416584,
    "meanResTime" : 136.14674667724697,
    "medianResTime" : 103.0,
    "minResTime" : 1.0,
    "maxResTime" : 10317.0,
    "pct1ResTime" : 142.0,
    "pct2ResTime" : 167.0,
    "pct3ResTime" : 238.0,
    "throughput" : 727.1022645319487,
    "receivedKBytesPerSec" : 200.16407743085605,
    "sentKBytesPerSec" : 177.5152013017453
  },
  "GET_character_by_id" : {
    "transaction" : "GET_character_by_id",
    "sampleCount" : 20054,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 107.44958611748282,
    "medianResTime" : 103.0,
    "minResTime" : 3.0,
    "maxResTime" : 501.0,
    "pct1ResTime" : 144.0,
    "pct2ResTime" : 169.0,
    "pct3ResTime" : 235.9900000000016,
    "throughput" : 727.5959654596909,
    "receivedKBytesPerSec" : 196.7468726756948,
    "sentKBytesPerSec" : 133.5085514589834
  }
}