Localhost_hw21/results/html_5000/statistics.json
{
  "DELETE /character/1" : {
    "transaction" : "DELETE /character/1",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.979200000000002,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 120.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 31.979999999999563,
    "throughput" : 25.273586574670812,
    "receivedKBytesPerSec" : 7.2316024085728,
    "sentKBytesPerSec" : 5.133939149101524
  },
  "GET_characters" : {
    "transaction" : "GET_characters",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.649000000000002,
    "medianResTime" : 3.0,
    "minResTime" : 2.0,
    "maxResTime" : 148.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 8.0,
    "pct3ResTime" : 101.70999999999367,
    "throughput" : 25.24130689390574,
    "receivedKBytesPerSec" : 10.698705404921046,
    "sentKBytesPerSec" : 4.560197046262267
  },
  "PUT_character_by_id" : {
    "transaction" : "PUT_character_by_id",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.7977999999999947,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 84.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 14.0,
    "throughput" : 25.271542726597286,
    "receivedKBytesPerSec" : 6.7870331161454835,
    "sentKBytesPerSec" : 6.194731333490859
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 25000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.3313999999999937,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 148.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 9.0,
    "throughput" : 126.20334893206724,
    "receivedKBytesPerSec" : 38.38008989937807,
    "sentKBytesPerSec" : 26.621743598650635
  },
  "POST_character" : {
    "transaction" : "POST_character",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.7004000000000012,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 37.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 13.0,
    "throughput" : 25.25801057805483,
    "receivedKBytesPerSec" : 6.906728994491228,
    "sentKBytesPerSec" : 6.166506488782917
  },
  "GET_character_by_id" : {
    "transaction" : "GET_character_by_id",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.5305999999999993,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 43.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 11.0,
    "throughput" : 25.27064864700947,
    "receivedKBytesPerSec" : 6.786792998324556,
    "sentKBytesPerSec" : 4.590418262402834
  }
}